#!/usr/bin/env bash
#
# nomeDoScript.sh - Breve descrição
#
# Site:       https://site.com.br
# Autor:      João Pedro
# Manutenção: João Pedro
#
# ----------------------------------------------------------------------- #
# Aqui você deve utilizar uma descrição mais detalahda sobre o seu programa, 
# explicando a forma de utilizar.
#
# Exemplos:
#     $ ./nomeDoScript.sh -d 1
#     Neste exemplo o script será executado no modo debug nível 1.
# ------------------------------------------------------------------------ #
# Histórico:
#
#   v1.0 18/08/2023, Autor da mudança:
#       - O que mudou?
#   v1.1 19/08/2023, Autor da mudança:
#       - O que mudou?
# ------------------------------------------------------------------------ #
# Testado em:
#   bash 4.4.19
# ------------------------------------------------------------------------ #
# Agradecimentos:
#
#   Joãozinho - Encontrou um bug na parte de login.
#   Mariazinha - Enviou uma sugestão de adicionar o -h.
# ------------------------------------------------------------------------ #

# ----------------------------- VARIÁVEIS -------------------------------- #
# ------------------------------------------------------------------------ #

# ------------------------------ TESTES ---------------------------------- #
# ------------------------------------------------------------------------ #

# ------------------------------ FUNÇÕES --------------------------------- #
# ------------------------------------------------------------------------ #

# ----------------------------- EXECUÇÃO --------------------------------- #
# ------------------------------------------------------------------------ #